[
  {
    "title" : "Family Calendar Dot Net",
    "description" : "Parents can create accounts and add their children to their accounts.They can then generate child codes to give to their children, and when their children enter the child codes into the registration page, they will be allowed to setup their account for the first time. Parents can then add 'incentives/rewards' which are worth a certain number of stars to the reward shop. These will be displayed to all children under the parent account when they shop for rewards. Parents can then also add chores and give each chore a number of stars the child can earn for completing the chore. Children will then be able to claim the stars when they complete that chore. A chore is marked completed when the child provides photographic proof that the chore was completed, and the parent has marked the chore complete on the application. When a child clicks on a chore, he/she will have the ability to upload a video or an image showing the chore was completed, as well as add a note for their parent. Parents can then mark that chore either completed, or incomplete and add a note to the chore. When the chores are completed, the child will receive the number of stars that the chore was worth which they can then spend on the reward shop.",
    "display_image" : "img/projects/familycalendardotnet.png",
    "links" : [
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/VigoFamilyCalendarAppDotNet"
      }
    ]
  },
  {
    "title" : "Flutter Bluetooth LED Controller App",
    "description" : "This project consists of a bluetooth enabled circuit created with an ATMEGA328P, an HM-10 bluetooth module, an ST7735 screen and a few other parts. There's also a Flutter application that sends commands to the circuit over bluetooth to turn a red and green led on and off.",
    "display_image" : "img/projects/bluetooth_led_controller.jpeg",
    "links" : [
      {
        "name" : "YouTube",
        "url" : "https://www.youtube.com/watch?v=LrqjanwMXyU"
      },
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/BluetoothLedControllerProject"
      }
    ]
  },
  {
    "title" : "Vigo's Rock Paper Scissors",
    "description" : "Last night I decided to make my second socket.io project. I decided to make a multiplayer rock paper scissors type game. The idea is players can join a chat, and the server will notify players of the current hand being played and provide a timer for players to make their selection: ‘rock’, ‘paper’ or ‘scissors’. When the current hand’s timer is up, the server displays everyones hands so that the group may determine the winner.\n\nThe focus of this project, was learning how to connect clients together using Socket.IO’s web socket functionality. I enjoyed working on this project and learning a bit more reactive programming using Node.js and Socket.IO",
    "display_image" : "img/projects/vigosrps.png",
    "links" : [
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/RockPaperScissorsSocketIO.git"
      }
    ]
  },
  {
    "title" : "Jobify MERN Course",
    "description" : "I just deployed my first MERN application. After going through John Smilga’s Udemy course, I am proud to announce that I was able to build and deploy my very first MERN application to Heroku. I followed the course step by step and was able to create this demo application.",
    "display_image" : "img/projects/jobify.png",
    "links" : [
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/Jobify.git"
      }
    ]
  },
  {
    "title" : "VigoChat",
    "description" : "For this project, I wanted to review some of the basics of jQuery, Node.js, Socket.io, and other remarkable technologies. It consists of a public multiuser chat UI with a private messaging feature. The entire front-end UI is driven basically by jQuery, and the backend is driven by a Node.js server running Socket.io. I had a lot of fun building this project. I did not put a lot of emphasis on security for this project, so don’t use it to send private information. It helped me to get a new appreciation of what it takes to build applications using these wonderful technologies and I plan to expand on this learning in the future.",
    "display_image" : "img/projects/vigochat.png",
    "links" : [
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/OpenShiftVigoChat.git"
      }
    ]
  },
  {
    "title" : "Unity Mini Games",
    "description" : "I recently bought a course from GameDevTv that walks you through the ins and outs of creating Unity 3D video games. It was an immersive course and I got a lot of knowledge out of it. I was able to create a few mini games while I learned Unity. And I decided to put two of them on a webpage to test how it would work using the OpenGL exporter. I thought it would be a good idea to include them here.",
    "display_image" : "img/projects/unitygames.png",
    "links" : [
      {
        "name" : "Demo",
        "url" : "https://gamesbyvigo.web.app/"
      }
    ]
  },
  {
    "title" : "Interactive Slide Puzzle Game",
    "description" : "This is a simple tiled slide puzzle game written in javascript, html and css. The idea is to get the numbers in order. You can grab tile pieces and drag them into the empty slot one at a time until you get them in the correct order. The project features cool css animations, audio and a simple game loop.",
    "display_image" : "img/projects/slidepuzzle.gif",
    "links" : [
      {
        "name" : "GitHub",
        "url" : "https://github.com/AldanisVigo/CodeupSlidePuzzle"
      },
      {
        "name" : "Demo",
        "url" : "https://aldanisvigo.github.io/CodeupSlidePuzzle/"
      }
    ]
  }
]